Examples/RegionSolvers/pitzDailyWithRASInlet/0.org/inChannel/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

    frontAndBack
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    inChannel_to_pitz
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
}

// ************************************************************************* //
