Examples/RegionSolvers/pitzDailyWithRASInlet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

functions
{
    inChannel {
        type rhoPimpleFlowRegionSolver;
        meshRegion inChannel;
        //      timeStart 10;
    }
    pressureDrop_pitz {
        type swakExpression;
        valueType patch;
        patchName outlet;
        verbose true;
        accumulations (
            weightedAverage
        );
        variables (
            "pIn{inlet}=sum(p*area())/sum(area());"
        );
        expression "pIn-p";
    }
    pressureDrop_inChannel {
        $pressureDrop_pitz;
        region inChannel;
        patchName inChannel_to_pitz;
    }
    pressureDrop_inInterface {
        $pressureDrop_pitz;
        patchName inlet
        variables (
            "pIn{inChannel_to_pitz}=sum(p*area())/sum(area());"
        );
    }
    pressureDrop_total {
        $pressureDrop_pitz;
        variables (
            "pIn{inlet/inChannel}=sum(p*area())/sum(area());"
        );
    }
    fieldAverage1 {
      type fieldAverage;
      libs (
          "libfieldFunctionObjects.so"
      );
      writeControl writeTime;

      fields (
          U {
            mean on;
            prime2Mean on;
            base time;
          }

          p {
            mean on;
            prime2Mean on;
            base time;
          }
      );
    }
}

libs (
    "libsimpleRegionSolvers.so"
    "libsimpleSwakFunctionObjects.so"
    "libgroovyBC.so"
);

// ************************************************************************* //
